Repository: willrat/ioMachine
Catalog: locale/*/LC_MESSAGES/machine.po
Languages: fi

source: Current Program:
fi: Tämänhetkinen ohjelma:

source: Current Status:
fi: Tämänhetkinen Asema:

source: Standby
fi: Valmiustila

source: Ready
fi: Valmis

source: Close Vice
fi: Sulje leuka

source: Cycle
fi: Työkierto

source: Open Vice
fi: Avaa leuka

source: Manual
fi: Käsiajo

source: Standby - Press start
fi: Valmiustila - Paina käynnistys

source: Ready - Hold control for cycle
fi: Valmis - Pidä ohjaus aloittaaksesi työkierto

source: Close Vice - Hold control to close vice
fi: Sulje leuka - Pidä ohjaus sulkeaksesi leuka

source: Cycle - Forming tube
fi: Työkierto - muotoillaan putkea

source: Open Vice - Hold control to open vice
fi: Avaa leuka - Pidä ohjaus avaaksesi leuka

source: Program Name
fi: Ohjelma nimi

source: Forming Start Position X
fi: Muotoilu Aloitus Asema X

source: Forming Start Position Y
fi: Muotoilu Aloitus Asema Y

source: Forming Position Y
fi: Putken Muokkaus Y

source: Forming Feed
fi: Muokkaus Nopeus

source: Forming Dwell
fi: Putken Muokkauksen Aika

source: Tube Stop Position X
fi: Putken Rajoitin Mitta X

source: Tube Stop Position Y
fi: Putken Rajoitin Mitta Y

source: Vice Unclamp Timer
fi: Avaa leuka Ajastin

source: Clearance Position X
fi: Puhdistuma Asema X

source: (COPY)
fi: (KOPIO)

source: CYCLE
fi: TYÖKIERTO

source: TUBE STOP
fi: PUTKEN ESTÄÄ

source: EDIT
fi: MUOKKAA

source: Tool Path Display
fi: Työkalu Reitti

source: AUTO
fi: AUTOMAATTINEN

source: X + (Head Back)
fi: X + (päätä taaksepäin)

source: X - (Head Forward)
fi: X - (päätä eteenpäin)

source: Y + (Tool out)
fi: Y + (työkalu ulos)

source: Y - (Tool in)
fi: Y - (työkalu Ulos)

source: X Jog Speed
fi: X Ryömintänopeus

source: Y Jog Speed
fi: Y Ryömintänopeus

source: <b>Position Jog</b>
fi: <b> Siirtoliike</b>

source: <b>Position</b>
fi: <b>Asema</b>

source: <b>Vice Control</b>
fi: <b>Leuan Ohjaus</b>

source: MANUAL
fi: KÄSIAJO

source: Current Program Name
fi: Tämänhetkisen Ohjelman Nimi

source: NEW
fi: UUSI

source: OPEN
fi: AVATA

source: DELETE
fi: POISTAA

source: PROGRAM STORE
fi: OHJELMA VARASTO

source: mcb1 (Q2) Spindle Motor
fi: MCB1 (Q2) karamoottori

source: mcb2 (Q2) X Axis Motor
fi: MCB2 (Q2) x-akseli moottori

source: mcb3 (Q3) Hydraulic Motor
fi: MCB3 (Q3) hydraulimoottori

source: Start Button
fi: Käynnistä-painike

source: Stop Button
fi: Pysäytyspainike

source: vice switch diagnostic
fi: vice kytkin diagnostiset

source: guard switch diagnostic
fi: vartija kytkin diagnostiset

source: <b>System Status</b>
fi: <b>järjestelmän tila</b>

source: Shutdown Machine
fi: Seisokki

source: Restart Control
fi: Käynnistä

source: SYSTEM
fi: OHJELMALAITE

source: Cancel
fi: Peruuta
